Revit 2027 API
PathReinforcement.IsAlternatingLayerEnabled Method
 Checks if alternating bars are present in Path Reinforcement.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsAlternatingLayerEnabled()
Public Function IsAlternatingLayerEnabled As Boolean
public:
bool IsAlternatingLayerEnabled()
member IsAlternatingLayerEnabled : unit -> bool
Return Value
Boolean
 True if the alternating bars exist in Path Reinforcement instance.
See Also
Reference
PathReinforcement Class
Autodesk.Revit.DB.Structure Namespace